org/roam/python.org
:PROPERTIES:
:ID:       a7f0c442-c2ec-4d7e-bc65-628631138d81
:END:
#+title: python
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* python
- override behavior with double underscore methods like ~__str(self)__~
- create and activate virtual environment ~python -m venv venv && source venv/bin/activate~
- run a http server on port 8080 ~python -m http.server 8080~
- pretty print json ~python -m json.tool~
- [[https://peps.python.org/pep-0703/][PEP to remove GIL]]
- [[https://peps.python.org/pep-0554/][sub interpreters PEP]]
- typing is optional ex. ~def test(name: str) -> str:~
- functools provides decorator annotations for things like ~@cache~
- decorators in stdlib such as ~@staticmethod~
- ~@dataclass(frozen=True)~ for immutable objects
- graalpy supports C extensions through llvm with pip venv building
- requirements.txt pin to git ~LIBRARY @ git+https://github.com/USER/REPO@BRANCH~
