docs/python.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>python</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="org4510572">
<div class="navbar-brand" id="org8969e81">
<div class="navbar-item" id="org9f7753f">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="org7dba9d1">
<div class="navbar-start" id="org7ef9cb4">
<div class="navbar-item" id="org350a51e">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="orge1f2696">

</div>

</div>
</nav>
<div id="outline-container-orga92fdf7" class="outline-2">
<h2 id="orga92fdf7">python</h2>
<div class="outline-text-2" id="text-orga92fdf7">
<ul class="org-ul">
<li>override behavior with double underscore methods like <code>__str(self)__</code></li>
<li>create and activate virtual environment <code>python -m venv venv &amp;&amp; source venv/bin/activate</code></li>
<li>run a http server on port 8080 <code>python -m http.server 8080</code></li>
<li>pretty print json <code>python -m json.tool</code></li>
<li><a href="https://peps.python.org/pep-0703/">PEP to remove GIL</a></li>
<li><a href="https://peps.python.org/pep-0554/">sub interpreters PEP</a></li>
<li>typing is optional ex. <code>def test(name: str) -&gt; str:</code></li>
<li>functools provides decorator annotations for things like <code>@cache</code></li>
<li>decorators in stdlib such as <code>@staticmethod</code></li>
<li><code>@dataclass(frozen=True)</code> for immutable objects</li>
<li>graalpy supports C extensions through llvm with pip venv building</li>
<li>requirements.txt pin to git <code>LIBRARY @ git+https://github.com/USER/REPO@BRANCH</code></li>
</ul>
</div>
</div>
</div>
</body>
</html>
